c5/src/Catalogs/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ranges</name>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Online</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Print</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Real</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Forms</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Ranges/ObjectModule.bsl
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	checkAttributes ( CheckedAttributes );
	if ( not checkRange () ) then
		Cancel = true;
	endif;
	checkAccount ( CheckedAttributes );
	
EndProcedure

Procedure checkAttributes ( CheckedAttributes )
	
	if ( Online ) then
		CheckedAttributes.Add ( "Description" );
	else
		CheckedAttributes.Add ( "Start" );
		CheckedAttributes.Add ( "Finish" );
		CheckedAttributes.Add ( "Prefix" );
	endif;
	
EndProcedure

Function checkRange ()
	
	if ( Start > Finish ) then
		OutputCont.RangeIncorrect ( , "Finish" );
		return false;
	endif;
	return true;
	
EndFunction

Procedure checkAccount ( CheckedAttributes )
	
	if ( not Item.IsEmpty () ) then
		CheckedAttributes.Add ( "Account" );
		CheckedAttributes.Add ( "ExpenseAccount" );
	endif;
	
EndProcedure

Procedure BeforeWrite ( Cancel )
	
	if ( DataExchange.Load
		or DeletionMark) then
		return;
	endif;
	setDescription ();
	
EndProcedure

Procedure setDescription ()
	
	if ( not Online ) then
		Description = "" + Type + " " + TrimR ( Prefix ) + " " + Format ( Start, "NG=" ) + " - " + Format ( Finish, "NG=" );
	endif;
	
EndProcedure
